tap "homebrew/cask-fonts"
tap "th-ch/youtube-music"

cask "youtube-music"
cask "zoom"
cask "docker"
cask "1password"
cask "affinity-photo"
cask "zen"
cask "audio-hijack"
cask "bartender"
cask "chatgpt"
cask "contexts"
cask "craft"
cask "discord"
cask "fantastical"
cask "ghostty"
cask "google-earth-pro"
cask "grammarly-desktop"
cask "handbrake"
cask "iina"
cask "linear-linear"
cask "karabiner-elements"
cask "macwhisper"
cask "mimestream"
cask "nextcloud"
cask "notion"
cask "plex"
cask "postico@1"
cask "qgis"
cask "rapidapi"
cask "raycast"
cask "slack"
cask "soundsource"
cask "steam"
cask "tailscale"
cask "textual"
cask "utm"
cask "whisky"

# Dev tools
cask "claude"
cask "imhex"
cask "orbstack"
cask "keyclu"

# Productivity
cask "soulver"
cask "macs-fan-control"

# Networking
cask "mullvad-vpn"

# Fonts
cask "font-jetbrains-mono-nerd-font"

mas "Dark Noise", id: 1465439395
mas "Rules", id: 6461118886
mas "Play", id: 1596506190
mas "Mela", id: 1568924476
mas "Parcel", id: 375589283
mas "Flighty", id: 1358823008
mas "HomeControl", id: 1547121417
mas "Magnet", id: 441258766
mas "Parcel", id: 639968404
mas "Paste", id: 967805235
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
