tap "artginzburg/tap"
tap "homebrew/services"
tap "withgraphite/tap"

brew "ansible"
brew "awscli"
brew "azure-cli"
brew "docker-compose"
brew "ffmpeg"
brew "gh"
brew "gnupg"
brew "golines"
brew "jq"
brew "mariadb"
brew "mariadb-connector-c"
brew "mysql@8.0"
brew "neovim"
brew "netcat"
brew "node"
brew "opentofu"
brew "p7zip"
brew "pngpaste"
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "yarn"
brew "yt-dlp"
brew "artginzburg/tap/sudo-touchid"
brew "mas"
brew "withgraphite/tap/graphite"

# Core dev tools
brew "go"
brew "coreutils"
brew "mise"
brew "pipx"
brew "rustup"
brew "swiftly"

# Kubernetes
brew "helm"
brew "kind"
brew "skaffold"
brew "stern"

# Git utilities
brew "bfg"
brew "git-filter-repo"

# Other utilities
brew "unar"
brew "vault"
